namespace BLL.Enums;

/// <summary>
/// Перелік назв підрозділів (кафедр/факультетів) для підвищення типізації та безпеки коду.
/// </summary>
public enum DepartmentName
{
    FICT,                // Факультет інформатики та обчислювальної техніки
    IPSA,                // Інститут прикладного системного аналізу
    IASA,                // Інститут аерокосмічних систем
    FMF,                 // Фізико-математичний факультет
    FL,                  // Факультет лінгвістики
    ComputerScience,     // Кафедра комп'ютерних наук
    SoftwareEngineering  // Кафедра інженерії програмного забезпечення
}
